Revit 2024 API
RebarFreeFormAccessor.SetCurves Method (IList<IList<Curve>>)
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public RebarFreeFormValidationResult SetCurves(
	IList<IList<Curve>> curves
)
Visual Basic
Public Function SetCurves ( _
	curves As IList(Of IList(Of Curve)) _
) As RebarFreeFormValidationResult
Visual C++
public:
RebarFreeFormValidationResult SetCurves(
	IList<IList<Curve^>^>^ curves
)
Parameters
curves
Type: System.Collections.Generic.IList<IList<Curve>>
 Each array of curves represent a bar in the set.
Return Value
 Returns Success(0) if everything is ok, otherwise the failure reason.
Remarks
This function can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarFreeFormAccessor Rebar is constrained.
See Also
RebarFreeFormAccessor Class
SetCurves Overload
Autodesk.Revit.DB.Structure Namespace